#pragma once
/*
Реализуемые функции должны генерировать подходящие исключения. Обработку исключений нужно выполнять главной функцией, которая должна демонстрировать обработку всех перехватываемых исключений.
Функции, реализуемые в заданиях, обязаны выполнять проверку передаваемых параметров и генерировать исключения в случае ошибочных. Все функции реализуются в четырех вариантах:

*без спецификации исключений;
*со спецификацией throw();
*с конкретной спецификацией с подходящим стандартным исключением;
*спецификация с собственным реализованным исключением.

Собственное исключение должно быть реализовано в трех вариантах: как пустой класс, как независимый класс с полями-параметрами функции, как наследник от стандартного исключения с полями.
Функция вычисляет корень квадратного уравнения ax2 +bx+c=0.
*/
